###############################################################
#  Generated by:      YONG-SHENG LIU (David)
#  Generated date:    2023/12/7
#  Design:            
#  Command:           # Using icc2
#                     (1) icc2_shell -gui 
#                     (2) icc2_shell -file design_setup.tcl
#                     (3) start_gui    -> when you are in icc2_shell
###############################################################

# used number of processor
set_host_options -max_cores 32

# library and tech file
create_lib CHIP -technology /usr/cad/CBDK/CBDK018_UMC_Faraday_v1.0/CIC/ICC/umc_018_1p6m_mk_20ka_cic.tf \
                -ref_libs { ../u18_cell_lib/fsa0m_a_generic_core_c.ndm \
                            ../u18_cell_lib/fsa0m_a_t33_generic_io_c.ndm \
                            ../u18_cell_lib/STD_LIB_macros.ndm \
                            ../u18_cell_lib/STD_LIB_physical_only.ndm \
                          } 

# read synthesize file
read_verilog -top top ../../syn/top_syn.v
link_block
report_ref_libs

# read parasitic model file in TLUPlus format
read_parasitic_tech -name rcmax \
                    -tlup /usr/cad/CBDK/CBDK018_UMC_Faraday_v1.0/CIC/ICC/tluplus/u18_rcmax.tluplus \
                    -layermap /usr/cad/CBDK/CBDK018_UMC_Faraday_v1.0/CIC/ICC/tluplus/u18.map
                    
read_parasitic_tech -name rcmin \
                    -tlup /usr/cad/CBDK/CBDK018_UMC_Faraday_v1.0/CIC/ICC/tluplus/u18_rcmin.tluplus \
                    -layermap /usr/cad/CBDK/CBDK018_UMC_Faraday_v1.0/CIC/ICC/tluplus/u18.map  

report_lib -parasitic_tech [current_lib]


set_attribute [get_site_defs unit] is_default true
set_attribute [get_site_defs unit] symmetry Y

set_attribute [get_layers {metal1}] track_offset  0.28
set_attribute [get_layers {metal2}] track_offset  0.31
set_attribute [get_layers {metal1 metal3 metal5}] routing_direction horizontal
set_attribute [get_layers {metal2 metal4 metal6}] routing_direction vertical
report_ignored_layers

source -echo ../script/MCMM.tcl
report_mode

save_block 
save_block -as CHIP:design_setup.design
save_lib